Show / Hide Table of Contents
Class MaterialStrength
Strength of material with specific thickness range
Inheritance
System.Object
OpenObject
MaterialStrength
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("IdeaRS.MprlModel.Material.MaterialStrength,CI.BasicTypes")]
public class MaterialStrength : OpenObject
Properties
Improve this Doc   View Source
Fu
Tension strength
Declaration
public double Fu { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fy
Yield strength
Declaration
public double Fy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MaxThickness
higher value of the thickness range
Declaration
public double MaxThickness { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source